# Pandas Explode
You may find yourself with a dataset that contains a list of values in a single column. But what you really want is to bring the values from the list into many rows or many columns. So, how do you do that? Using the pandas `.explode()` method and others give you the tools to perform this. For more in depth information about it, you can find it [here](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.explode.html).  

Let's practice the different ways we can using `explode`.

In [1]:
import numpy as np
import pandas as pd

In [2]:
# Create a random array
array = np.random.rand(25, 5).round(decimals=2)
array

array([[0.56, 0.62, 0.86, 0.46, 0.64],
       [0.78, 0.65, 0.1 , 0.69, 0.76],
       [0.73, 0.53, 0.75, 0.76, 0.65],
       [0.26, 0.24, 0.99, 0.54, 0.8 ],
       [0.28, 0.51, 0.96, 0.56, 0.45],
       [0.17, 0.52, 0.1 , 0.03, 0.4 ],
       [0.9 , 0.03, 0.67, 0.01, 0.23],
       [0.83, 0.16, 0.65, 0.75, 0.91],
       [0.3 , 0.12, 0.04, 0.71, 0.46],
       [0.35, 0.8 , 0.15, 0.32, 0.32],
       [0.48, 0.08, 0.16, 0.14, 0.67],
       [0.12, 0.67, 0.92, 0.38, 0.29],
       [0.68, 0.76, 0.46, 0.69, 0.47],
       [0.31, 0.67, 0.39, 0.13, 0.08],
       [0.  , 0.45, 0.26, 0.91, 0.28],
       [0.43, 0.41, 0.85, 0.74, 0.16],
       [0.31, 0.2 , 0.44, 0.54, 0.58],
       [0.45, 0.06, 0.99, 0.97, 0.25],
       [0.87, 0.28, 0.85, 0.18, 0.91],
       [0.8 , 0.62, 0.68, 0.81, 0.58],
       [0.44, 0.41, 0.93, 0.88, 0.61],
       [0.1 , 0.07, 0.57, 0.77, 0.64],
       [0.99, 0.  , 0.65, 0.62, 0.71],
       [0.68, 0.42, 0.63, 0.95, 0.71],
       [0.04, 0.87, 0.99, 0.98, 0.7 ]])

## Explode a list of values into rows

In [3]:
# create dataframe with single column
df = pd.DataFrame({"list_values": array.tolist()})
df.head()

                      list_values
0  [0.56, 0.62, 0.86, 0.46, 0.64]
1   [0.78, 0.65, 0.1, 0.69, 0.76]
2  [0.73, 0.53, 0.75, 0.76, 0.65]
3   [0.26, 0.24, 0.99, 0.54, 0.8]
4  [0.28, 0.51, 0.96, 0.56, 0.45]

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 1 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   list_values  25 non-null     object
dtypes: object(1)
memory usage: 328.0+ bytes

In [5]:
# each value is a list
type(df.iloc[0][0])

list

In [6]:
# separate list into row with replicating index values
df.explode(column="list_values")

   list_values
0         0.56
0         0.62
0         0.86
0         0.46
0         0.64
..         ...
24        0.04
24        0.87
24        0.99
24        0.98
24         0.7

[125 rows x 1 columns]

## Explode a list of values into columns

In [7]:
# separate list into column by column
pd.DataFrame(df.list_values.values.tolist()).head()

      0     1     2     3     4
0  0.56  0.62  0.86  0.46  0.64
1  0.78  0.65  0.10  0.69  0.76
2  0.73  0.53  0.75  0.76  0.65
3  0.26  0.24  0.99  0.54  0.80
4  0.28  0.51  0.96  0.56  0.45

## Explode a string representation of a list into columns

In [8]:
# now each list is a actually a list of values for each row
df_str = pd.DataFrame({"list_values": [str(a) for a in array.tolist()]})
df_str.head()

                      list_values
0  [0.56, 0.62, 0.86, 0.46, 0.64]
1   [0.78, 0.65, 0.1, 0.69, 0.76]
2  [0.73, 0.53, 0.75, 0.76, 0.65]
3   [0.26, 0.24, 0.99, 0.54, 0.8]
4  [0.28, 0.51, 0.96, 0.56, 0.45]

In [9]:
# each value is a str
type(df_str.iloc[0][0])

str

In [10]:
# This does not work as expected
pd.DataFrame(df_str.list_values.values.tolist()).head()

                                0
0  [0.56, 0.62, 0.86, 0.46, 0.64]
1   [0.78, 0.65, 0.1, 0.69, 0.76]
2  [0.73, 0.53, 0.75, 0.76, 0.65]
3   [0.26, 0.24, 0.99, 0.54, 0.8]
4  [0.28, 0.51, 0.96, 0.56, 0.45]

In [11]:
# One option is to evaluate each string as a list, then proceed as usual
# 'eval' parses and evaluates the string of a list as a python expression
# turning it back into a list
pd.DataFrame(df_str.list_values.apply(lambda u: eval(u)).values.tolist()).head()

      0     1     2     3     4
0  0.56  0.62  0.86  0.46  0.64
1  0.78  0.65  0.10  0.69  0.76
2  0.73  0.53  0.75  0.76  0.65
3  0.26  0.24  0.99  0.54  0.80
4  0.28  0.51  0.96  0.56  0.45